# Rpstr_SetValueStr

## Description
Set a string value from the VectorScript value repository.

```pascal
PROCEDURE Rpstr_SetValueStr(
				name  : STRING;
				value : DYNARRAY[] of CHAR);
```

```python
def vs.Rpstr_SetValueStr(name, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|The name of the value.|
|value|DYNARRAY[] of CHAR|Set a value associated with the name in the VectorScript value repository.|

## Examples
```pascal
	END
	ELSE
		listSetting := Rpstr_GetValueStr( kSettingDefList, '1' );
	proceed := (listSetting = '1');
	Rpstr_SetValueStr( kSettingDefList, listSetting );
END
```
```python
import vs

# Set a string value from the VectorScript value repository.
name = 'Example'
value = 'Example'

vs.Rpstr_SetValueStr(name, value)
```

## See Also
VS Functions:
Rpstr_RemoveValues
| Rpstr_RemoveValue
| Rpstr_GetValueBool
| Rpstr_SetValueBool
| Rpstr_GetValueInt
| Rpstr_SetValueInt
| Rpstr_GetValueReal
| Rpstr_SetValueReal
| Rpstr_GetValueStr
| Rpstr_SetValueStr

## Version
Availability: from Vectorworks 2012

## Category
* Utility